# DSP - Aufgabenblatt 11

## Bewertete Übung

#### FHNW - HS2019

#### Vorgaben für die Zusammenarbeit

Sie dürfen für die Lösung der Übung zusammenarbeiten, so lange sich ihre **Zusammenarbeit auf konzeptionelle und algorithmische Fragestellungen beschränkt**. Bei kopiertem Code oder Text (von Mitstudierenden oder dem Internet) werden alle Lösungen der beteiligten Parteien mit 0 Punkten bewertet. Dazu werden alle Lösungen manuell und automatisiert auf Kopien untersucht.  

#### Abgabe

Arbeiten Sie auf einem eigenen Fork des Repositories `https://gitlab.fhnw.ch/ml/courses/dsp/dsp_hs2019.git` zu welchem Sie den Dozenten (@michael.graber) als *Maintainer* hinzufügen. Committen Sie regelmässig. Als Abgabe gilt ihr **letzter Commit vor Montag, 23. Dezember 2019, 24 Uhr**.

#### Hinweise
- Der *Code* muss von Anfang bis Ende durchlaufen. Es wird nur Code bewertet, welcher beim automatischen Durchlaufen ausgeführt wird.    
- Beschriften Sie sämtliche Achsen (Bezeichnung und Einheit wenn möglich).  
- Ergänzen Sie den Plot mit zusätzlicher Beschriftung falls dies zum Verständnis des Plots notwendig ist.  
- Wenn Sie einen Plot in einer Antwort diskutieren, beginnen Sie mit einer Beschreibung dessen was der Plot zeigt.  


- Sämtliche Variablen die in einer von Ihnen definierten Funktionen verwendet werden, müssen als Argumente übergeben  oder innerhalb der Funktion definiert werden.
- Selbst definierte Funktionen müssen einen (kurzen) docstring haben.


- Versuchen Sie eine kompakte und performante Implementierung zu finden. Vollständige Punktzahl erreichen Sie bloss mit performantem *Code*.  
- Verwenden Sie dazu, wo immer möglich und sinnvoll, Funktionen aus `pandas` und `numpy`.
- Vermeiden Sie *Loops* falls möglich.

Am 14. April 1912 ist die Titanic vor der Küste Neufundlands auf ihrer Jungfernfahrt mit einem Eisberg kollidiert und sank kanpp 3 Stunden später in den frühen Morgenstunden des 15. Aprils. Von den ca 2224 Passagieren und Crewmitgliedern starben rund 1500.  

Auf der Website https://www.encyclopedia-titanica.org/ können Passagier- und Crewlisten runtergeladen werden. Ich habe Ihnen zwei Dateien bereitgestellt: 'data/titanic_survivors.csv' und 'data/titanic_victims.csv'. Sie beinhalten jeweils die Überlebenden und Opfer des Unglücks.  

Wir werden in dieser Übung die Personen hinter diesem Unglück miteinander untersuchen.

### Aufgabe 1 (10 Punkte)  

Schreiben Sie eine Funktion, mit welcher Sie die beiden Dateien laden und präprozessieren können.  

Die Funktion soll ein `DataFrame` zurückgeben mit folgenden Spalten: `'name', 'sex', 'age', 'is_adult', 'job', 'class_dept', 'is_passenger', 'joined', 'boat_body', 'ticketprice', 'survived',`.  


- Der Ticketpreis steht bei Passagieren jeweils auf der folgenden Zeile im Feld `Ticket`. Extrahieren Sie Pfund, Shilling und Pence mittels *regular expression-matching* auf dem `DataFrame`.
- Berechnen Sie einen Dezimalbetrag in Pfund gemäss dem folgenden Satz: *'There were 12 pence in a shilling and 20 shillings in a pound.'* 
- Leiten Sie das Geschlecht `sex` aus dem Namen, insbesondere aus der Anrede, ab. Finden Sie einen geeignete `pandas`-Methode für das *Mapping*.
- Berechnenen Sie das Alter für alle Personen in Jahren (`m` steht für *months*).
- `is_passenger` soll `True` sein, falls `class_dept` in `['1st Class Passenger', '2nd Class Passenger', '3rd Class Passenger',]` ist.  
- Sortieren Sie das `DataFrame` nach dem Familiennamen.

Jeder *for-Loop* gibt 2 Punkte Abzug.  

Laden Sie die Daten und geben Sie die ersten 10 Zeilen aus.

In [1]:
# imports
import pandas as pd
import numpy as np

In [35]:
# Funktion CSV-File loader
def loadFile(filepath):
    #load data 
    raw_df = pd.read_csv(filepath, header=None, skiprows=6, sep='\n')
    df = raw_df[0].str.split(',', expand=True)
    
    # check len of columns
    if (len(df.columns) == 10):
        df = df.drop(df.columns[9], axis = 1)
        
    # give header names
    df.columns = ['Data Extracted', 'Name', 'Age', 'Class/Dept', 'Ticket', 'Joined', 'Job', 'Boat[Body]', 'Nothing']
    clean_df = df.drop(columns=['Nothing'])
        
    return clean_df

In [36]:
# load File of titanic_victims
titanic_victims_df = loadFile('../../data/titanic_victims.csv')
titanic_victims_df.head(10)

,Data Extracted,Name,Age,Class/Dept,Ticket,Joined,Job,Boat[Body]
0,ABBING,Mr Anthony,41,3rd Class Passenger,5547,Southampton,Blacksmith,
1,,,,£7 11s,,,,None
2,ABBOTT,Mr Rossmore Edward,16,3rd Class Passenger,CA2673,Southampton,Jeweller,[190]
3,,,,£20 5s,,,,None
4,ABBOTT,Mr Eugene Joseph,13,3rd Class Passenger,CA2673,Southampton,Scholar,
5,,,,£20 5s,,,,None
6,ABBOTT,Mr Ernest Owen,21,Victualling Crew,,Southampton,Lounge Pantry Steward,
7,ABELSON,Mr Samuel,30,2nd Class Passenger,3381,Cherbourg,,
8,,,,£24,,,,None
9,ABĪ SA'B,Mr Jirjis Yūsuf,45,3rd Class Passenger,2685,Cherbourg,Shoemaker,[312]

In [37]:
# load File of titanic_survivors
titanic_survivors_df = loadFile('../../data/titanic_survivors.csv')
titanic_survivors_df.head(10)

,Data Extracted,Name,Age,Class/Dept,Ticket,Joined,Job,Boat[Body]
0,ABBOTT,Mrs Rhoda Mary 'Rosa',39,3rd Class Passenger,CA2673,Southampton,,A
1,,,,£20 5s,,,,
2,ABELSETH,Miss Karen Marie,16,3rd Class Passenger,348125,Southampton,,16
3,,,,£7 13s,,,,
4,ABELSETH,Mr Olaus Jørgensen,25,3rd Class Passenger,348122,Southampton,Farmer,A
5,,,,£7 13s,,,,
6,ABELSON,Mrs Anna,24,2nd Class Passenger,3381,Cherbourg,,10
7,,,,£24,,,,
8,ABRAHAMSSON,Mr August Abraham Johannes,19,3rd Class Passenger,3101284,Southampton,,15
9,,,,£7 18s 6d,,,,

1 shift ticketprice and make a switch drop

2 mergeing of the files?

3 rename the columns

4 create new column for survived?

In [9]:
def cleanFile(df):
    # mergin of two csv-Files
    
    #shift ticketprice and make a switch
    df.shift(periods=1, axis='columns')
    
    return clean_df

In [38]:
#cleanFile(titanic_victims_df.head(15))

In [47]:
file = '../../data/titanic_victims.csv'
victims_df = pd.read_csv(file, header=None, skiprows=6, sep='\n')
victims_df = victims_df[0].str.split(',', expand=True)
victims_df.columns = ['Data Extracted', 'Name', 'Age', 'Class/Dept', 'Ticket', 'Joined', 'Job', 'Boat[Body]', 'Nothing']
cleaned_victims_df = victims_df.drop(columns=['Nothing'])
cleaned_victims_df = victims_df.drop(victims_df.columns[8], axis = 1)
cleaned_victims_df.head(30)

mask = cleaned_victims_df[['Class/Dept']].isna().all(axis=1)

cleaned_victims_df.loc[mask, 'Class/Dept':'Ticket'] = cleaned_victims_df.loc[mask, 'Class/Dept':'Ticket'].shift(1, axis=1)
cleaned_victims_df.head(10)

,Data Extracted,Name,Age,Class/Dept,Ticket,Joined,Job,Boat[Body]
0,ABBING,Mr Anthony,41,3rd Class Passenger,5547,Southampton,Blacksmith,
1,,,,£7 11s,,,,None
2,ABBOTT,Mr Rossmore Edward,16,3rd Class Passenger,CA2673,Southampton,Jeweller,[190]
3,,,,£20 5s,,,,None
4,ABBOTT,Mr Eugene Joseph,13,3rd Class Passenger,CA2673,Southampton,Scholar,
5,,,,£20 5s,,,,None
6,ABBOTT,Mr Ernest Owen,21,Victualling Crew,,Southampton,Lounge Pantry Steward,
7,ABELSON,Mr Samuel,30,2nd Class Passenger,3381,Cherbourg,,
8,,,,£24,,,,None
9,ABĪ SA'B,Mr Jirjis Yūsuf,45,3rd Class Passenger,2685,Cherbourg,Shoemaker,[312]

In [23]:
file = '../../data/titanic_survivors.csv'
survivors_df = pd.read_csv(file, header=None, skiprows=6, sep='\n')
survivors_df = survivors_df[0].str.split(',', expand=True)
survivors_df.columns = ['Data Extracted', 'Name', 'Age', 'Class/Dept', 'Ticket', 'Joined', 'Job', 'Boat[Body]', 'Nothing', 'Nothing']
cleaned_survivors_df = survivors_df.drop(columns=['Nothing'])
if(len(survivors_df.columns) == 10):
        survivors_df = survivors_df.drop(survivors_df.columns[9], axis = 1)
survivors_df.head(10)

,Data Extracted,Name,Age,Class/Dept,Ticket,Joined,Job,Boat[Body]
0,ABBOTT,Mrs Rhoda Mary 'Rosa',39,3rd Class Passenger,CA2673,Southampton,,A
1,,,,£20 5s,,,,
2,ABELSETH,Miss Karen Marie,16,3rd Class Passenger,348125,Southampton,,16
3,,,,£7 13s,,,,
4,ABELSETH,Mr Olaus Jørgensen,25,3rd Class Passenger,348122,Southampton,Farmer,A
5,,,,£7 13s,,,,
6,ABELSON,Mrs Anna,24,2nd Class Passenger,3381,Cherbourg,,10
7,,,,£24,,,,
8,ABRAHAMSSON,Mr August Abraham Johannes,19,3rd Class Passenger,3101284,Southampton,,15
9,,,,£7 18s 6d,,,,

### Aufgabe 2 (8 Punkte)

Wieviele Personen sind es insgesamt?  

Wieviele Personen ohne Ticketpreis?  

Wieviele Personen ohne Altersangabe?  

Wieviele Personen männlichen und weiblichen Geschlechts fanden sich gemäss unserem Datensatz auf der Titanic?  

Wie viele Kinder, welchen Geschlechts?  

Was war der durchschnittliche Preis für eine Fahrkarte?  

Was war das Durchschnittsalter der Besatzungsmitglieder? Was war das Durchschnittsalter der Passagiere?

In [ ]:
# YOUR CODE HERE
raise NotImplementedError()

### Aufgabe 3 (3 Punkte)

Erstellen Sie eine Kreuztabelle von Einstiegsort und `class_dept`.  

Visualisieren Sie die Tabelle.  
Wir wissen, dass die Titanic von *Belfast*, wo sie gebaut wurde, nach *Southhampton*, nach *Cherbourg* und dann nach *Queenstown* fuhr, bevor Sie zur Atlantiküberfahrt auslief.  

Diskutieren Sie Ihre Erkenntnisse.

In [ ]:
# YOUR CODE HERE
raise NotImplementedError()

YOUR ANSWER HERE

### Aufgabe 4 (5 Punkte)

Visualisieren Sie die Altersverteilung für die beiden Geschlechter und gleichzeitig für Variable `class_dept` mit Boxplots.  

Diskutieren Sie die Visualisierung.
- Erklären Sie was ein Boxplot zeigt.
- Was für Information fehlt?
- Was können wir zu den vorliegenden Daten aus dieser Darstellung lesen?

In [ ]:
# YOUR CODE HERE
raise NotImplementedError()

YOUR ANSWER HERE

### Aufgabe 5 (4 Punkte)

Zeichnen Sie die Verteilung des Alters sämtlicher Passagiere als Histogramm.  

Beschreiben Sie die Verteilung bezüglich Lage, Streuung und Form.  

Sie dürfen verschiedene Ansätze verwenden und deren Resultate und Eigenschaften diskutieren.

In [ ]:
# YOUR CODE HERE
raise NotImplementedError()

YOUR ANSWER HERE

### Aufgabe 6 (3 Punkte)

Führen Sie die Schritte aus Aufgabe 5 für den Ticketpreis aus.  

Visualisieren Sie zusätzlich die kumulative Verteilung.  

Diskutieren Sie Ihre Erkenntnisse.

In [ ]:
# YOUR CODE HERE
raise NotImplementedError()

YOUR ANSWER HERE

### Aufgabe 7 (3 Punkte)

Was sind die häufigsten 10 Berufe der Passagiere, welche oberhalb des $Q_{0.9}$-Quantils des Ticketpreises liegen?  

Was sind die häufigsten 10 Berufe der Passagiere, welche unterhalb des $Q_{0.1}$-Quantils des Ticketpreises liegen?  

Wie oft kommen die Berufe jeweils vor?  
Wie interpretieren Sie das Resultat?

In [ ]:
# YOUR CODE HERE
raise NotImplementedError()

YOUR ANSWER HERE

### Aufgabe 8 (6 Punkte)

Finden Sie ein paar wenige Visualisierungen, welche es ermöglichen, kompakt einen Eindruck zu bekommen, wer das Unglück der Titanic am wahrscheinlichsten überlebt hat.  

Was ist ihre Erkenntnis?

In [ ]:
# YOUR CODE HERE
raise NotImplementedError()

YOUR ANSWER HERE

### Aufgabe 9 (6 Punkte)

Untersuchen Sie nun, ob das Alter einen Einfluss auf die Überlebenswahrscheinlichkeit hatte.  

Teilen Sie die Passagiere dazu in Gruppen von Geschlecht und Altersjahrzenten ein.  
Berechnen Sie für die jeweiligen Gruppen den Anteil der Überlebenden, sowie den [*Standard Error of the Mean* (SEM)](https://en.wikipedia.org/wiki/Standard_error).  

Visualisieren Sie die Resultate übersichtlich und diskutieren Sie diese.  
Was können wir durch die Visualisierung des SEM erkennen?

In [ ]:
# YOUR CODE HERE
raise NotImplementedError()

YOUR ANSWER HERE